Tekla Open API Reference for Tekla Structures 2025
LineTypesEnum Enumeration
 The line types (the presentation of the line).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LineTypesEnum
Public Enumeration LineTypesEnum
Members
Member name | Value | Description
UndefinedLine | 0 |  The line type is undefined.
SolidLine | 1 |  The solid line (default).
DashedLine | 2 |  The dashed line (-----).
SlashedLine | 3 |  The slashed line (- - -).
DashDot | 4 |  The dash dotted line (--.--.).
DottedLine | 5 |  The dotted line (.....).
DashDoubleDot | 6 |  The dash double dotted line (-..-..-).
SlashDash | 7 |  The slash dash line (-- - -- -).
Custom | 9999 |  The custom line type (it will also transport the custom line type name)
See Also
Reference
Tekla.Structures.Drawing Namespace